package main

import "fmt"

/**
一只青蛙一次可以跳上1级台阶，也可以跳上2级台阶。求该青蛙跳上一个 n 级的台阶总共有多少种跳法。

答案需要取模 1e9+7（1000000007），如计算初始结果为：1000000008，请返回 1。

*/

// 1 1 , 1
// 2 2 , 1, 1 | 2
// 3 3 , 1, 1, 1 | 1, 2, | 2, 1
// 4 5 , 1, 1, 1, 1 | 1, 2, 1| 1, 1 ,2 | 2, 1, 1 | 2, 2
// 5 8 , 1, 1, 1, 1, 1 | 2, 1, 1, 1 | 1, 2, 1, 1| 1, 1, 2, 1| 1, 1, 1, 2| 2, 2, 1| 2,1,2| 1,2,2|
func numWays(n int) int {
	// 0 <= n <= 100
	a, b, sum := 1, 1, 0
	for i := 0; i <= n; i++ {
		sum = (a + b) % 1000000007
		a = b
		b = sum
	}
	return a
}

func main() {
	fmt.Println(numWays(10))
}
